var rule = {
    title: '傻傻视频',
    host: 'https://www.shczrgs.cn',
    url: 'https://www.shczrgs.cn/cat/fyclass?page=fypage',
    homeUrl: 'https://www.shczrgs.cn/#new',
    searchUrl: 'https://www.shczrgs.cn/q/**?category_id=&page=fypage',
    searchable: 1,
    quickSearch: 1,
    filterable: 1,
    limit: 30,
    编码: 'utf-8',
    timeout: 5000,
    headers: {
        'User-Agent': 'MOBILE_UA',
    },
    class_name: '国产自拍&中文字幕&日本无码&国产精品&强奸乱伦&日本有码&制服诱惑&国产情色&欧美精品&亚洲有码&站长推荐&萝莉少女&无字幕视&美女主播&AV明星&成人动漫&最多观看&日韩无码&无码专区&自拍偷拍&有码精品&巨乳美乳&抖阴视频&最火影片&动漫精品&欧美情色&国产传媒&女优明星&骑兵有码&国产主播&女同性恋&亚洲情色&卡通动漫&偷拍自拍&网红主播&亚洲无码&伦理三级&抖阴短片&欧美性爱&网曝门事&美乳巨乳&91探花&制服丝袜&欧美极品&国产视频&无码典藏&童颜巨乳&动漫卡通&AV解说&激情动漫&精品推荐&三级伦理&SWAG&日韩精品&国产乱伦&名优中字&大秀视频&邻家人妻&欧美-高&人妻熟女&熟女人妻&主播网红&国产探花&绝美少女&SM调教&探花系列&映画传媒&Cosp&步兵无码&巨乳系列&女同性爱&国产裸聊&激情口交&欧美专区&多人群交&高清无码&麻豆传媒&网红头条&主播直播&福利姬视&黑丝诱惑&性感人妻&角色扮演&日本女优&人妻系列&调教中文&国产-主&巨乳中文&乱伦中文&口交视频&长腿丝袜&日本素人&人妻中文&国产盗摄&高潮喷吹&传媒原创&欧美系列&群交淫乱&制服中文&韩国-主&VR视角&日本精品&金发幼齿&国产色情&出轨中文&独家DM&精品短视&网曝视频&淫乱学生&教师学生&AI换脸&网爆黑料&伦理片视&传媒自拍&欧美激情&明星换脸&空姐模特&其他片商&HEY诱&传媒-糖&剧情片视&口交颜射&无码中文&禁漫视频&网曝黑料&SM重味&韩国伦理&开心鬼传&传媒剧情&嫖妓全过&韩国明星&探花约炮&偷拍偷窥&动漫肉番&HEYZ&自慰群交&国模私拍&女神学生&女优系列&素人自拍&乱伦毁三&极骚萝莉&欧美无码&主播诱惑&美熟少妇&网曝吃瓜&自慰系列&燃烧荷尔&娇妻素人&91大神&狼友探花&绿帽淫妻&换脸明星&职场同事&素人搭讪&网红流出&口爆颜射&日本-中&国产名人&国产-自&日本-无&剧情介绍&主播大秀&恋腿狂魔&人妖系列&日本片商&动漫-黄&韩国主播&日本-高&欺辱凌辱&国产大制&麻豆视频&抖音视频&三级自慰&东南亚A&剧情故事&黑料吃瓜&视频伦理&主播秀色&野合车震&伦理影片&强奸中文&国产-吃&日韩主播&丝袜OL&国产-探&重口激情&日本伦理&国产伦理&华语AV&日本-一&女仆系列&3P合辑&学生校园&闷骚护士&台湾辣妹&唯美港姐&传媒-麻&重咸口味&颜射系列&韩国御姐&风情旗袍&高清名优&日本-素&AV明星&多人多P&瑜伽裤视&喜剧片视&传媒-其&可爱学生&野外露出&精品动漫&三级片视&国产丝袜&岛国群交&剧情动漫&香港伦理&SM重口&成人头条&东南亚情&乐播传媒&三级字幕&兽耳系列&制服师生&古装扮演&动作片视&美颜巨乳&精品素人&乌鸦传媒&国产人妻&口交潮吹&天美传媒&糖心Vl&mini&虚拟VR&黑料不打&蜜桃传媒&首次亮相&动漫-里&岛国素人&激情中字&丝袜美腿&韩国精品&91系列&星空传媒&多P 3&童真萝莉&恋腿癖视&大象传媒&精东影业&凌辱束缚&热门大瓜&媚黑母狗&乱伦中出&3D动漫&韩国极品&日本乱伦&国产SM&女优合集&同性同志&主播自拍&贫乳小奶&翘臀美尻&韩美眉主&欧美视频&91制片&传媒出品&P站原创&韩国自拍&记录片视&骚货护士&国产直播&性感港姐&野外系列&同性女优&惊悚片视&台湾色情&学生中出&性感旗袍&高丽棒子&无码破解&吃瓜爆料&萝莉社视&名优写真&女同口交&兔子先生&乱伦背德&兽耳作品&及膝袜视&男同性恋&TS人妖&韩国唯美&人兽性交&杏吧原创&人妖视频&岛国女优&国产-网&淫娃自慰&非亚洲视&日本AV&重口调教&VR有码&性视界视&悬疑片视&百万三区&名优综艺&皇家华人&传媒-9&其他亚洲&国产女奴&明星淫梦&恐怖片视&传媒-蜜&极品媚黑&传媒-S&韩国直播&爱情片视&国产女王&日韩伦理&AI合成&科幻片视&传媒-扣&星空无限&监控摄像&成人综艺&国产-台&同人动漫&传媒-天&精选独家&玩偶姐姐&性世界视&传媒-星&SM虐待&VR无码&女同人妖&传媒-精&传媒-果&欧美-中&果冻传媒&SA国际&精选口爆&杏吧传媒&Psyc&香港三级&传媒-性&JVID&黑人洋屌&奇幻片视&三级剧情&欧美刺激&扣扣传媒&辣椒GI&少女破处&探花嫖娼',
    class_url: '263&48&270&249&13&269&92&119&260&105&625&103&633&264&401&274&627&259&254&98&616&93&25&626&86&265&390&438&261&268&115&22&130&278&88&64&367&514&52&58&111&455&248&266&304&632&125&149&392&453&140&84&452&275&252&37&89&273&658&23&267&586&482&109&375&433&395&418&288&99&132&521&134&531&129&280&416&437&303&27&454&425&221&432&101&16&649&292&290&110&138&393&289&522&96&370&131&520&291&653&451&467&262&460&19&97&36&547&583&128&357&440&644&639&328&69&5&536&123&655&697&374&293&643&483&106&44&506&512&584&54&511&515&315&124&33&31&250&471&419&582&142&246&510&8&513&100&588&15&314&201&524&516&6&450&457&369&657&251&664&668&415&253&468&477&403&674&158&666&466&585&490&441&143&472&587&641&148&417&24&120&30&682&317&424&660&518&45&285&642&651&402&126&665&469&461&464&650&144&136&459&458&394&717&439&470&410&698&652&465&456&534&548&629&391&517&61&243&499&426&495&442&463&272&462&702&378&532&498&628&215&501&503&500&523&581&494&135&648&372&598&169&55&429&497&423&408&422&496&504&421&677&589&645&591&57&530&630&525&152&208&436&434&59&232&493&474&62&159&699&420&209&413&407&398&701&412&414&406&443&70&576&508&40&595&505&399&427&409&473&545&56&141&507&147&371&679&711&50&171&373&18&509&706&721&60&492&687&287&71&163&700&661&519&663&715&704&72&150&400&710&684&533&592&593&676&596&673&435&502&537&672&669&34&428&670&671&654&535&538&151&541&491&529&686&540&647&708&276&634&539&146&557&631',
    play_parse: true,
    lazy: $js.toString(() => {
        input = {
            parse: 1,
            url: input,
            js: 'document.querySelector("#playleft iframe").contentWindow.document.querySelector("#start").click();'
        };
    }),
    double: true,
    lazy: $js.toString(() => {
        let html = JSON.parse(request(input).match(/r player_.*?=(.*?)</)[1]);
        let url = html.url;
        if (html.encrypt == '1') {
            url = unescape(url)
        } else if (html.encrypt == '2') {
            url = unescape(base64Decode(url))
        }
        if (/\.m3u8|\.mp4/.test(url)) {
            input = {
                jx: 0,
                url: url,
                parse: 0
            }
        } else {
            input
        }
    }),
    tab_rename: {
        '道长在线': '傻傻专线'
    },
    hikerListCol: "movie_3",
    hikerClassListCol: "movie_3",
    推荐: '*',
    一级: '.card;img&&alt;img&&src;;a&&href',
    二级: '*',
    搜索: '*',
}