var rule = {
    title: '爱追剧',
    类型: '影视',
    host: 'https://www.aizju.com',
    //↑域名
    searchable: 2,
    quickSearch: 1,
    filterable: 1,
    headers: {
    'User-Agent': 'MOBILE_UA',
    'Referer': '',
     'Cookie': ''
       },
    编码: 'utf-8',
    timeout: 5000,
    //↑请求头
url: '/vodshow/fyfilter.html',
filter_url: '{{fl.cateId}}--{{fl.by}}-{{fl.class}}-{{fl.lang}}----fypage---{{fl.year}}',
    //filter_url: '{{fl.cateId}}{{fl.area}}{{fl.by}}{{fl.class}}{{fl.letter}}/page/fypage',
    //↓详情页url
    //detailUrl: '/d9html/fyid.html',
  //  searchUrl: '/vodsearch/**/page/fypage.html',
  searchUrl: '/vodsearch/-------------.html?wd=**&submit=',
    //搜索url
     //  searchUrl: '/index.php/ajax/suggest?mid=1&wd=**&page=fypage&limit=30',
    搜索: '.hl-item-div;a&&title;a&&data-original;.hl-lc-1.remarks&&Text;a&&href',
    // 搜索: 'json:list;name;pic;en;id',
    推荐: '/',


    //推荐: '数组;标题;图片;副标题;链接',
    一级: '.hl-list-item;a&&title;a&&data-original;.hl-lc-1.remarks&&Text;a&&href',
    //一级: '数组;标题;图片;副标题;链接',
二级: $js.toString(() => {
let html = request(input);
VOD = {};
 VOD.vod_id = input;
VOD.vod_name = pdfh(html, 'h2&&Text');
VOD.type_name = pdfh(html, 'li:contains(类型：)&&Text').replace(/类型：|\//g,'');
 
 VOD.vod_pic = pd(html, 'a&&data-original', input);
 VOD.vod_remarks = pdfh(html, 'li:contains(状态：)&&Text');
 VOD.vod_year = pdfh(html, '');
VOD.vod_area = pdfh(html, '');
 
VOD.vod_director = pdfh(html, 'li:contains(导演)&&Text').replace('导演：','');
 VOD.vod_actor = pdfh(html, 'li:contains(主演)&&Text').replace('主演：','');
 VOD.vod_content = pdfh(html,'.hl-col-xs-12.blurb&&Text').replace('简介：','');
 //↓线路数组
let r_ktabs = pdfa(html,'.hl-plays-from.hl-tabs a');
 let ktabs = r_ktabs.map(it => pdfh(it, 'Text'));
 VOD.vod_play_from = ktabs.join('$$$');
 
let klists = [];
//↓播放数组
let r_plists = pdfa(html, '.hl-plays-list');
r_plists.forEach((rp) => {
    let klist = pdfa(rp, 'a').map((it) => {
        return pdfh(it, 'a&&Text') + '$' + pd(it, 'a&&href', input);
    }).filter(item => {
        // 过滤掉标题包含"APP播放"的无关项
        return !item.includes('APP播放');
    });
    klist = klist.join('#');
    klists.push(klist);
});
VOD.vod_play_url = klists.join('$$$');
}),
    /*二级: {
        title: '标题;类型',
        img: '图片链接',
        desc: '主要信息;年代;地区;演员;导演',
        content: '简介',
        tabs: '线路数组',
        tab_text: '线路标题',
        lists: '播放数组',       
        list_text: '播放标题',
        list_url: '播放链接',
    },*/

    //播放地址通用解析
    play_parse: true,
lazy: $js.toString(() => {
    let html = fetch(input);
    let kcode = html.match(/src="\/player\/mui-player\.php\?([^"]*)"/);
    
    if (kcode) {
        let kurl = kcode[1].split(',')[1];
        
        if (kurl && /\.(m3u8|mp4)/.test(kurl)) {
            input = { 
                jx: 0, 
                parse: 0, 
                url: kurl,  
                header: {
                    'User-Agent': MOBILE_UA,
                    'Referer': getHome(kurl)
                }
            }
        } else {
            input = { jx: 0, parse: 1, url: input }
        }
    }
}),
class_name: '电影&电视剧&综艺&动漫',
    //分类: '电影&电视剧&综艺&动漫',
    class_url: '1&2&3&4',
    //分类值: '1&2&3&4',
    
filter_def: {
        1: {
            cateId: '1'
        },
        2: {
            cateId: '2'
        },
        3: {
            cateId: '3'
        },
        4: {
            cateId: '4'
        }
    },
filter: {
 
  "1": [
    {
      "key": "class",
      "name": "剧情",
      "value": [
          {"n": "全部", "v": ""},
          {"n": "喜剧", "v": "喜剧"},
          {"n": "爱情", "v": "爱情"},
          {"n": "恐怖", "v": "恐怖"},
          {"n": "动作", "v": "动作"},
		  {"n": "悬疑", "v": "悬疑"},
		  {"n": "惊悚", "v": "惊悚"},
		  {"n": "谍战", "v": "谍战"},
		  {"n": "灾难", "v": "灾难"},
		  {"n": "歌舞", "v": "歌舞"},
		  {"n": "历史", "v": "历史"},
          {"n": "科幻", "v": "科幻"},
          {"n": "剧情", "v": "剧情"},
          {"n": "战争", "v": "战争"},
          {"n": "警匪", "v": "警匪"},
          {"n": "犯罪", "v": "犯罪"},
          {"n": "动画", "v": "动画"},
          {"n": "奇幻", "v": "奇幻"},
          {"n": "武侠", "v": "武侠"},
		  {"n": "记录", "v": "记录"},
          {"n": "枪战", "v": "枪战"},
		  {"n": "经典", "v": "经典"},
		  {"n": "青春", "v": "青春"},
		  {"n": "文艺", "v": "文艺"},
		  {"n": "微电影", "v": "微电影"},
		  {"n": "古装", "v": "古装"},
		  {"n": "运动", "v": "运动"},
		  {"n": "农村", "v": "农村"},
		  {"n": "儿童", "v": "儿童"},
		  {"n": "网络电影", "v": "网络电影"}
        ]
      },
    {
      "key": "lang",
      "name": "语言",
      "value": [
        {"n": "全部", "v": ""},
        {"n": "国语", "v": "国语"},
        {"n": "英语", "v": "英语"},
        {"n": "粤语", "v": "粤语"},
        {"n": "闽南语", "v": "闽南语"},
        {"n": "韩语", "v": "韩语"},
        {"n": "日语", "v": "日语"},
        {"n": "法语", "v": "法语"},
        {"n": "德语", "v": "德语"},
		{"n": "其它", "v": "其它"}
      ]
    },
    {
      "key": "year",
      "name": "年份",
      "value": [
        {"n": "全部", "v": ""},
        {"n": "2024", "v": "2024"},
        {"n": "2023", "v": "2023"},
        {"n": "2022", "v": "2022"},
        {"n": "2021", "v": "2021"},
        {"n": "2020", "v": "2020"},
        {"n": "2019", "v": "2019"},
        {"n": "2018", "v": "2018"},
        {"n": "2017", "v": "2017"},
        {"n": "2016", "v": "2016"},
        {"n": "2015", "v": "2015"},
        {"n": "2014", "v": "2014"},
        {"n": "2013", "v": "2013"},
		{"n": "2012", "v": "2012"},
		{"n": "2011", "v": "2011"},
		{"n": "2010", "v": "2010"},
		{"n": "2009", "v": "2009"},
		{"n": "2008", "v": "2008"},
		{"n": "2007", "v": "2007"},
		{"n": "2006", "v": "2006"},
		{"n": "2005", "v": "2005"},
		{"n": "2004", "v": "2004"},
		{"n": "2003", "v": "2003"},
		{"n": "2002", "v": "2002"},
		{"n": "2001", "v": "2001"},
		{"n": "2000", "v": "2000"}
      ]
    },
    {
      "key": "by",
      "name": "排序",
      "value": [
        {"n": "时间", "v": "time"},
        {"n": "人气", "v": "hits"},
        {"n": "评分", "v": "score"}
      ]
    }
  ],
  
   "2": [
    {
      "key": "class",
      "name": "剧情",
      "value": [
          {"n": "全部", "v": ""},
          {"n": "古装", "v": "古装"},
          {"n": "战争", "v": "战争"},
          {"n": "青春偶像", "v": "青春偶像"},
          {"n": "喜剧", "v": "喜剧"},
		  {"n": "家庭", "v": "家庭"},
		  {"n": "犯罪", "v": "犯罪"},
		  {"n": "动作", "v": "动作"},
		  {"n": "奇幻", "v": "奇幻"},
		  {"n": "剧情", "v": "剧情"},
		  {"n": "历史", "v": "历史"},
          {"n": "经典", "v": "经典"},
          {"n": "乡村", "v": "乡村"},
          {"n": "情景", "v": "情景"},
          {"n": "商战", "v": "商战"},
          {"n": "网剧", "v": "网剧"},
          {"n": "其他", "v": "其他"}
        ]
      },
    {
      "key": "lang",
      "name": "语言",
      "value": [
        {"n": "全部", "v": ""},
        {"n": "国语", "v": "国语"},
        {"n": "英语", "v": "英语"},
        {"n": "粤语", "v": "粤语"},
        {"n": "闽南语", "v": "闽南语"},
        {"n": "韩语", "v": "韩语"},
        {"n": "日语", "v": "日语"},
		{"n": "其它", "v": "其它"}
      ]
    },
    {
      "key": "year",
      "name": "年份",
      "value": [
        {"n": "全部", "v": ""},
        {"n": "2024", "v": "2024"},
        {"n": "2023", "v": "2023"},
        {"n": "2022", "v": "2022"},
        {"n": "2021", "v": "2021"},
        {"n": "2020", "v": "2020"},
        {"n": "2019", "v": "2019"},
        {"n": "2018", "v": "2018"},
        {"n": "2017", "v": "2017"},
        {"n": "2016", "v": "2016"},
        {"n": "2015", "v": "2015"},
        {"n": "2014", "v": "2014"},
        {"n": "2013", "v": "2013"},
		{"n": "2012", "v": "2012"},
		{"n": "2011", "v": "2011"},
		{"n": "2010", "v": "2010"},
		{"n": "2009", "v": "2009"},
		{"n": "2008", "v": "2008"},
		{"n": "2007", "v": "2007"},
		{"n": "2006", "v": "2006"},
		{"n": "2005", "v": "2005"},
		{"n": "2004", "v": "2004"},
		{"n": "2003", "v": "2003"},
		{"n": "2002", "v": "2002"},
		{"n": "2001", "v": "2001"},
		{"n": "2000", "v": "2000"}
      ]
    },
    {
      "key": "by",
      "name": "排序",
      "value": [
        {"n": "时间", "v": "time"},
        {"n": "人气", "v": "hits"},
        {"n": "评分", "v": "score"}
      ]
    }
  ],
  
  "3": [
    {
      "key": "class",
      "name": "剧情",
      "value": [
          {"n": "全部", "v": ""},
          {"n": "选秀", "v": "选秀"},
          {"n": "情感", "v": "情感"},
          {"n": "访谈", "v": "访谈"},
          {"n": "播报", "v": "播报"},
		  {"n": "旅游", "v": "旅游"},
		  {"n": "音乐", "v": "音乐"},
		  {"n": "美食", "v": "美食"},
		  {"n": "纪实", "v": "纪实"},
		  {"n": "曲艺", "v": "曲艺"},
		  {"n": "生活", "v": "生活"},
          {"n": "游戏互动", "v": "游戏互动"},
          {"n": "财经", "v": "财经"},
          {"n": "求职", "v": "求职"}
        ]
      },
    {
      "key": "lang",
      "name": "语言",
      "value": [
        {"n": "全部", "v": ""},
        {"n": "国语", "v": "国语"},
        {"n": "英语", "v": "英语"},
        {"n": "粤语", "v": "粤语"},
        {"n": "闽南语", "v": "闽南语"},
        {"n": "韩语", "v": "韩语"},
        {"n": "日语", "v": "日语"},
		{"n": "其它", "v": "其它"}
      ]
    },
    {
      "key": "year",
      "name": "年份",
      "value": [
        {"n": "全部", "v": ""},
        {"n": "2024", "v": "2024"},
        {"n": "2023", "v": "2023"},
        {"n": "2022", "v": "2022"},
        {"n": "2021", "v": "2021"},
        {"n": "2020", "v": "2020"},
        {"n": "2019", "v": "2019"},
        {"n": "2018", "v": "2018"},
        {"n": "2017", "v": "2017"},
        {"n": "2016", "v": "2016"},
        {"n": "2015", "v": "2015"},
        {"n": "2014", "v": "2014"},
        {"n": "2013", "v": "2013"},
		{"n": "2012", "v": "2012"},
		{"n": "2011", "v": "2011"},
		{"n": "2010", "v": "2010"},
		{"n": "2009", "v": "2009"},
		{"n": "2008", "v": "2008"},
		{"n": "2007", "v": "2007"},
		{"n": "2006", "v": "2006"},
		{"n": "2005", "v": "2005"},
		{"n": "2004", "v": "2004"},
		{"n": "2003", "v": "2003"},
		{"n": "2002", "v": "2002"},
		{"n": "2001", "v": "2001"},
		{"n": "2000", "v": "2000"}
      ]
    },
    {
      "key": "by",
      "name": "排序",
      "value": [
        {"n": "时间", "v": "time"},
        {"n": "人气", "v": "hits"},
        {"n": "评分", "v": "score"}
      ]
    }
  ],
   "4": [
    {
      "key": "class",
      "name": "剧情",
      "value": [
          {"n": "全部", "v": ""},
          {"n": "情感", "v": "情感"},
          {"n": "科幻", "v": "科幻"},
          {"n": "热血", "v": "热血"},
          {"n": "推理", "v": "推理"},
		  {"n": "搞笑", "v": "搞笑"},
		  {"n": "冒险", "v": "冒险"},
		  {"n": "萝莉", "v": "萝莉"},
		  {"n": "校园", "v": "校园"},
		  {"n": "动作", "v": "动作"},
		  {"n": "机战", "v": "机战"},
          {"n": "运动", "v": "运动"},
          {"n": "战争", "v": "战争"},
          {"n": "少年", "v": "少年"},
          {"n": "少女", "v": "少女"},
          {"n": "社会", "v": "社会"},
          {"n": "原创", "v": "原创"},
          {"n": "亲子", "v": "亲子"},
          {"n": "益智", "v": "益智"},
		  {"n": "励志", "v": "励志"},
          {"n": "其他", "v": "其他"}
        ]
      },
    {
      "key": "lang",
      "name": "语言",
      "value": [
        {"n": "全部", "v": ""},
        {"n": "国语", "v": "国语"},
        {"n": "英语", "v": "英语"},
        {"n": "粤语", "v": "粤语"},
        {"n": "闽南语", "v": "闽南语"},
        {"n": "韩语", "v": "韩语"},
        {"n": "日语", "v": "日语"},
		{"n": "其它", "v": "其它"}
      ]
    },
    {
      "key": "year",
      "name": "年份",
      "value": [
        {"n": "全部", "v": ""},
        {"n": "2024", "v": "2024"},
        {"n": "2023", "v": "2023"},
        {"n": "2022", "v": "2022"},
        {"n": "2021", "v": "2021"},
        {"n": "2020", "v": "2020"},
        {"n": "2019", "v": "2019"},
        {"n": "2018", "v": "2018"},
        {"n": "2017", "v": "2017"},
        {"n": "2016", "v": "2016"},
        {"n": "2015", "v": "2015"},
        {"n": "2014", "v": "2014"},
        {"n": "2013", "v": "2013"},
		{"n": "2012", "v": "2012"},
		{"n": "2011", "v": "2011"},
		{"n": "2010", "v": "2010"},
		{"n": "2009", "v": "2009"},
		{"n": "2008", "v": "2008"},
		{"n": "2007", "v": "2007"},
		{"n": "2006", "v": "2006"},
		{"n": "2005", "v": "2005"},
		{"n": "2004", "v": "2004"},
		{"n": "2003", "v": "2003"},
		{"n": "2002", "v": "2002"},
		{"n": "2001", "v": "2001"},
		{"n": "2000", "v": "2000"}
      ]
    },
    {
      "key": "by",
      "name": "排序",
      "value": [
        {"n": "时间", "v": "time"},
        {"n": "人气", "v": "hits"},
        {"n": "评分", "v": "score"}
      ]
    }
  ],


 },

}