var rule = {
    author: '冰水化合物/250921/第1版',
    title: '电影港影院',
    类型: '影视',
    //主页 网页的域名根
    host: 'https://fsxindamuye.com/',
    hostJs: ``,
    headers :{
    
        'User-Agent': 'MOBILE_UA'
},
    
    //不填就默认utf-8，根据网页源码所显示的格式填，根据需要可填UTF-8，GBK，GB2312
    编码: 'utf-8',
    timeout: 5000,
    //首页链接，可以是完整路径或者相对路径,用于分类获取和推荐获取
    homeUrl: '/',
    //分类链接,分类参数用fyclasss,页码用fypage，带筛选的用fyfilter，第一页无页码的用[]括起，处理方式同xbpq方式，fyfilter代表filter_url里内容
      url: '/show/fyfilter',
  filter_url: '{{fl.cateId}}-{{fl.area}}-{{fl.by}}-{{fl.class}}-{{fl.lang}}-{{fl.letter}}---fypage---{{fl.year}}',
  
  
//filter_url: '{{fl.cateId}}{{fl.area}}{{fl.by}}{{fl.class}}{{fl.letter}}/page/fypage',
    //↓详情页url
   detailUrl: '/type/fyid.html',
    //↓搜索链接 可以是完整路径或者相对路径,用于分类获取和推荐获取 **代表搜索词 fypage代表页数
 searchUrl: 'https://fsxindamuye.com/kiyu/page/fypage/wd/**/',
    // ↓ 搜索页找参数  数组标题图片副标题链接
  搜索: '*',
    //rss搜索写法
   //searchUrl: '/rss/index.xml?wd=**&page=fypage',
   //ajax搜索写法
   //searchUrl: '/index.php/ajax/suggest?mid=1&wd=**&page=fypage&limit=30',

// 搜索: 'json:list;name;pic;en;id',  

    searchable: 1,
    quickSearch: 1,
    filterable: 1,
    limit: 10,
    double: false,
    class_name: '电影&电视剧&综艺&动漫&短剧&少儿',
    //静态分类值
    class_url: 'dianying&dianshiju&zongyi&dongman&duanju&donghuapian',

    filter_def: {
dianying: {
            cateId: 'dianying'
        },
        dianshiju: {
            cateId: 'dianshiju'
        },
zongyi: {
            cateId: 'zongyi'
        },
        dongman: {
            cateId: 'dongman'
        },
        
     duanju: {
            cateId: 'duanju'
        },
        donghuapian: {
            cateId: 'donghuapian'
        }

    },
    //推荐列表可以单独写也是几个参数，和一级列表部分参数一样的可以用*代替，不一样写不一样的，全和一级一样，可以用一个*代替
    推荐: '*',
    //推荐页的json模式
    //推荐: 'json:list;vod_name;vod_pic;vod_remarks;vod_id',
    //数组、标题、图片、副标题、链接，分类页找参数
  //  一级: '.hl-list-item;a&&title;a&&data-original;.remarks&&Text;a&&href',

一级: $js.toString(() => {
    let klist = pdfa(request(input), '.lazyload');
    //数组
    let k = klist.map(it => ({
        title: pdfh(it, 'a&&title'),
        //标题
        pic_url: pdfh(it, 'a&&data-original'),
        //图片
        desc: pdfh(it, '.text-right&&Text'),
       // 副标题
        url: pdfh(it, 'a&&href'),
        //链接
        content: ''
    }));
    setResult(k);
}),

    //详情页找参数
    //第一部分分别是对应参数式中的标题、类型、图片、备注、年份、地区、导演、主演、简介
    //第二部分分别对应参数式中的线路数组和线路标题
    //第三部分分别对应参数式中的播放数组、播放列表、播放标题、播放链接
    
二级: $js.toString(() => {
    let html = request(input);
    VOD = {
        vod_id: input,
        vod_name: pdfh(html, 'h1.title&&Text'),
        type_name: pdfh(html, 'p.data:contains(类型)&&Text').replace('类型：', ''),
        vod_pic: pd(html, '.lazyload&&data-original', input),
        vod_remarks: pdfh(html, '.pic-text&&Text').replace('更新至', ''),
        vod_year: pdfh(html, 'p.data:contains(年份)&&Text').replace('年份：', ''),
        vod_area: pdfh(html, 'p.data:contains(地区)&&Text').replace('地区：', ''),
        vod_director: pdfh(html, 'p.data:contains(导演)&&Text').replace('导演：', ''),
        vod_actor: pdfh(html, 'p.data:contains(主演)&&Text').replace('主演：', ''),
        vod_content: pdfh(html, 'p.desc&&Text').replace('简介：', '').replace('详情 <<i class="icon iconfont icon-moreunfold"></</i>', '')
    };

let r_ktabs = pdfa(html,'.stui-pannel__head.active&&h3');
         //线路列表
 let ktabs = r_ktabs.map(it => pdfh(it, 'Text'));
         //线路名称
 VOD.vod_play_from = ktabs.join('$$$');

let klists = [];
let r_plists = pdfa(html, '.stui-content__playlist.clearfix');
r_plists.forEach((rp) => {
    let klist = pdfa(rp, 'li a').map((it) => {
        return pdfh(it, 'a&&Text') + '$' + pd(it, 'a&&href', input);
    }).filter(item => {
        // 过滤掉标题行和排序按钮
        return !item.includes('展开全部') && !item.includes('视频排序：正序');
    });
    klist = klist.join('#');
    klists.push(klist);
});
VOD.vod_play_url = klists.join('$$$');
}),






    //是否启用辅助嗅探: 1,0
    sniffer: 0,
    // 辅助嗅探规则
    isVideo: 'http((?!http).){26,}\\.(m3u8|mp4|flv|avi|mkv|wmv|mpg|mpeg|mov|ts|3gp|rm|rmvb|asf|m4a|mp3|wma)',

  play_parse: true,
    //播放地址通用解析
    lazy: $js.toString(() => {
let kcode = JSON.parse(fetch(input).split('aaaa=')[1].split('<')[0]);
let kurl = kcode.url;
if (/\.(m3u8|mp4)/.test(kurl)) {
    input = { jx: 0, parse: 0, url: kurl, header: {'User-Agent': MOBILE_UA, 'Referer': getHome(kurl)} }
} else {
    input = { jx: 0, parse: 1, url: input }
}
}),









filter: {
        "dianying": [

            {
                "key": "cateId",
                "name": "类型",
                "value": [
{"n":"全部","v":"1"},
{"n": "最新动作", "v": "dongzuo"},{"n": "最新爱情", "v": "aiqing"},{"n": "最新喜剧", "v": "xiju"},{"n": "最新恐怖", "v": "kongbu"},{"n": "最新惊悚", "v": "jings"},{"n": "最新悬疑", "v": "xuanyi"},{"n": "最新犯罪", "v": "fanzui"},{"n": "最新剧情", "v": "juqing"},{"n": "最新战争", "v": "zhanzheng"},{"n": "最新灾难", "v": "zainan"},{"n": "最新科幻", "v": "kehuan"},{"n": "最新奇幻", "v": "qihuan"},{"n": "最新冒险", "v": "maoxian"},{"n": "最新纪录", "v": "jilu"},{"n": "最新其他", "v": "qita"},{"n": "最新邵氏电影", "v": "shaoshi"},{"n": "最新理论电影", "v": "lilun"}
]
            },
{
  "key": "class",
  "name": "剧情",
  "value": [
    {"n": "全部", "v": ""},
    {"n": "动作", "v": "动作"},
    {"n": "剧情", "v": "剧情"},
    {"n": "喜剧", "v": "喜剧"},
    {"n": "伦理", "v": "伦理"},
    {"n": "纪录", "v": "纪录"},
    {"n": "恐怖", "v": "恐怖"},
    {"n": "惊悚", "v": "惊悚"},
    {"n": "悬疑", "v": "悬疑"},
    {"n": "情色", "v": "情色"},
    {"n": "科幻", "v": "科幻"},
    {"n": "爱情", "v": "爱情"},
    {"n": "犯罪", "v": "犯罪"},
    {"n": "理论", "v": "理论"},
    {"n": "奇幻", "v": "奇幻"},
    {"n": "灾难", "v": "灾难"},
    {"n": "战争", "v": "战争"},
    {"n": "冒险", "v": "冒险"},
    {"n": "武侠", "v": "武侠"},
    {"n": "同性", "v": "同性"},
    {"n": "邵氏电影", "v": "邵氏电影"},
    {"n": "三级", "v": "三级"},
    {"n": "古装", "v": "古装"},
    {"n": "励志", "v": "励志"},
    {"n": "4K电影", "v": "4K电影"}
  ]
},
            {
                "key": "area",
                "name": "地区",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "大陆", "v": "大陆"},
  {"n": "香港", "v": "香港"},
  {"n": "台湾", "v": "台湾"},
  {"n": "美国", "v": "美国"},
  {"n": "法国", "v": "法国"},
  {"n": "英国", "v": "英国"},
  {"n": "日本", "v": "日本"},
  {"n": "韩国", "v": "韩国"},
  {"n": "德国", "v": "德国"},
  {"n": "泰国", "v": "泰国"},
  {"n": "印度", "v": "印度"},
  {"n": "意大利", "v": "意大利"},
  {"n": "西班牙", "v": "西班牙"},
  {"n": "加拿大", "v": "加拿大"},
  {"n": "其他", "v": "其他"}
]



            },
            
            {
                "key": "year",
                "name": "年份",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "2025", "v": "2025"},
  {"n": "2024", "v": "2024"},
  {"n": "2023", "v": "2023"},
  {"n": "2022", "v": "2022"},
  {"n": "2021", "v": "2021"},
  {"n": "2020", "v": "2020"},
  {"n": "2019", "v": "2019"},
  {"n": "2018", "v": "2018"},
  {"n": "2017", "v": "2017"},
  {"n": "2016", "v": "2016"},
  {"n": "2015", "v": "2015"}
]

            },
            
            
            {
                "key": "lang",
                "name": "语言",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "国语", "v": "国语"},
  {"n": "英语", "v": "英语"},
  {"n": "粤语", "v": "粤语"},
  {"n": "闽南语", "v": "闽南语"},
  {"n": "韩语", "v": "韩语"},
  {"n": "日语", "v": "日语"},
  {"n": "法语", "v": "法语"},
  {"n": "德语", "v": "德语"},
  {"n": "其它", "v": "其它"}
]

            },
            
            
            {
                "key": "letter",
                "name": "字母",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "A", "v": "A"},
  {"n": "B", "v": "B"},
  {"n": "C", "v": "C"},
  {"n": "D", "v": "D"},
  {"n": "E", "v": "E"},
  {"n": "F", "v": "F"},
  {"n": "G", "v": "G"},
  {"n": "H", "v": "H"},
  {"n": "I", "v": "I"},
  {"n": "J", "v": "J"},
  {"n": "K", "v": "K"},
  {"n": "L", "v": "L"},
  {"n": "M", "v": "M"},
  {"n": "N", "v": "N"},
  {"n": "O", "v": "O"},
  {"n": "P", "v": "P"},
  {"n": "Q", "v": "Q"},
  {"n": "R", "v": "R"},
  {"n": "S", "v": "S"},
  {"n": "T", "v": "T"},
  {"n": "U", "v": "U"},
  {"n": "V", "v": "V"},
  {"n": "W", "v": "W"},
  {"n": "X", "v": "X"},
  {"n": "Y", "v": "Y"},
  {"n": "Z", "v": "Z"},
  {"n": "0-9", "v": "0-9"}
]


            },
{
  "key": "by",
  "name": "排序",
  "value": [
    {"n": "按最新", "v": "time"},
    {"n": "按最热", "v": "hits"},
    {"n": "按评分", "v": "score"}
  ]
}
        ],
        "dianshiju": [



            {
                "key": "cateId",
                "name": "类型",
                "value":[
{"n":"全部","v":""},
{"n": "最新国产剧", "v": "guochanju"},
{"n": "最新港台剧", "v": "gangtaiju"},
{"n": "最新韩国剧", "v": "hanguoju"},
{"n": "最新日本剧", "v": "ribenju"},
{"n": "最新欧美剧", "v": "oumeiju"},
{"n": "最新泰国剧", "v": "taiguoju"},
{"n": "最新其他剧", "v": "qitaju"}
]


            },
{
  "key": "class",
  "name": "剧情",
  "value": [
    {"n": "全部", "v": ""},
    {"n": "国产剧", "v": "国产剧"},
    {"n": "网剧", "v": "网剧"},
    {"n": "短剧", "v": "短剧"},
    {"n": "韩剧", "v": "韩剧"},
    {"n": "港剧", "v": "港剧"},
    {"n": "台剧", "v": "台剧"},
    {"n": "泰剧", "v": "泰剧"},
    {"n": "日剧", "v": "日剧"},
    {"n": "喜剧", "v": "喜剧"},
    {"n": "古装", "v": "古装"},
    {"n": "爱情", "v": "爱情"},
    {"n": "悬疑", "v": "悬疑"},
    {"n": "科幻", "v": "科幻"},
    {"n": "欧美剧", "v": "欧美剧"},
    {"n": "动作", "v": "动作"},
    {"n": "恐怖", "v": "恐怖"},
    {"n": "战争", "v": "战争"},
    {"n": "武侠", "v": "武侠"},
    {"n": "家庭", "v": "家庭"},
    {"n": "犯罪", "v": "犯罪"},
    {"n": "惊悚", "v": "惊悚"},
    {"n": "传记", "v": "传记"},
    {"n": "同性", "v": "同性"},
    {"n": "运动", "v": "运动"},
    {"n": "奇幻", "v": "奇幻"},
    {"n": "青春", "v": "青春"},
    {"n": "都市", "v": "都市"},
    {"n": "偶像", "v": "偶像"},
    {"n": "冒险", "v": "冒险"},
    {"n": "理论", "v": "理论"},
    {"n": "伦理", "v": "伦理"},
    {"n": "其他", "v": "其他"}
  ]
},
            {
                "key": "area",
                "name": "地区",
                "value": [
  {"n": "全部", "v": ""},
  {"n": "内地", "v": "内地"},
  {"n": "韩国", "v": "韩国"},
  {"n": "香港", "v": "香港"},
  {"n": "台湾", "v": "台湾"},
  {"n": "日本", "v": "日本"},
  {"n": "美国", "v": "美国"},
  {"n": "泰国", "v": "泰国"},
  {"n": "英国", "v": "英国"},
  {"n": "新加坡", "v": "新加坡"},
  {"n": "其他", "v": "其他"}
]




            },
            
            {
                "key": "year",
                "name": "年份",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "2025", "v": "2025"},
  {"n": "2024", "v": "2024"},
  {"n": "2023", "v": "2023"},
  {"n": "2022", "v": "2022"},
  {"n": "2021", "v": "2021"},
  {"n": "2020", "v": "2020"},
  {"n": "2019", "v": "2019"},
  {"n": "2018", "v": "2018"},
  {"n": "2017", "v": "2017"},
  {"n": "2016", "v": "2016"},
  {"n": "2015", "v": "2015"}
]

            },
            
            
            {
                "key": "lang",
                "name": "语言",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "国语", "v": "国语"},
  {"n": "英语", "v": "英语"},
  {"n": "粤语", "v": "粤语"},
  {"n": "闽南语", "v": "闽南语"},
  {"n": "韩语", "v": "韩语"},
  {"n": "日语", "v": "日语"},
  {"n": "法语", "v": "法语"},
  {"n": "德语", "v": "德语"},
  {"n": "其它", "v": "其它"}
]

            },
            
            
            {
                "key": "letter",
                "name": "字母",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "A", "v": "A"},
  {"n": "B", "v": "B"},
  {"n": "C", "v": "C"},
  {"n": "D", "v": "D"},
  {"n": "E", "v": "E"},
  {"n": "F", "v": "F"},
  {"n": "G", "v": "G"},
  {"n": "H", "v": "H"},
  {"n": "I", "v": "I"},
  {"n": "J", "v": "J"},
  {"n": "K", "v": "K"},
  {"n": "L", "v": "L"},
  {"n": "M", "v": "M"},
  {"n": "N", "v": "N"},
  {"n": "O", "v": "O"},
  {"n": "P", "v": "P"},
  {"n": "Q", "v": "Q"},
  {"n": "R", "v": "R"},
  {"n": "S", "v": "S"},
  {"n": "T", "v": "T"},
  {"n": "U", "v": "U"},
  {"n": "V", "v": "V"},
  {"n": "W", "v": "W"},
  {"n": "X", "v": "X"},
  {"n": "Y", "v": "Y"},
  {"n": "Z", "v": "Z"},
  {"n": "0-9", "v": "0-9"}
]


            },
{
  "key": "by",
  "name": "排序",
  "value": [
    {"n": "按最新", "v": "time"},
    {"n": "按最热", "v": "hits"},
    {"n": "按评分", "v": "score"}
  ]
}

        ],

        "zongyi": [


            {
                "key": "cateId",
                "name": "类型",
                "value":
[
{"n":"全部","v":""},
{"n": "最新大陆综艺", "v": "daluzongyi"},
{"n": "最新港台综艺", "v": "gangtai"},
{"n": "最新日韩综艺", "v": "rihan"},
{"n": "最新欧美综艺", "v": "oumei"}
]



            },
{
  "key": "class",
  "name": "剧情",
  "value": [
    {"n": "全部", "v": ""},
    {"n": "大陆综艺", "v": "大陆综艺"},
    {"n": "日韩综艺", "v": "日韩综艺"},
    {"n": "港台综艺", "v": "港台综艺"},
    {"n": "欧美综艺", "v": "欧美综艺"},
    {"n": "演唱会", "v": "演唱会"},
    {"n": "真人秀", "v": "真人秀"},
    {"n": "音乐", "v": "音乐"},
    {"n": "脱口秀", "v": "脱口秀"},
    {"n": "歌舞", "v": "歌舞"},
    {"n": "爱情", "v": "爱情"},
    {"n": "相声", "v": "相声"},
    {"n": "晚会", "v": "晚会"}
  ]
},
            {
                "key": "area",
                "name": "地区",
                "value": [
  {"n": "全部", "v": ""},
  {"n": "内地", "v": "内地"},
  {"n": "港台", "v": "港台"},
  {"n": "日韩", "v": "日韩"},
  {"n": "欧美", "v": "欧美"}
]



            },
            
            {
                "key": "year",
                "name": "年份",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "2025", "v": "2025"},
  {"n": "2024", "v": "2024"},
  {"n": "2023", "v": "2023"},
  {"n": "2022", "v": "2022"},
  {"n": "2021", "v": "2021"},
  {"n": "2020", "v": "2020"},
  {"n": "2019", "v": "2019"},
  {"n": "2018", "v": "2018"},
  {"n": "2017", "v": "2017"},
  {"n": "2016", "v": "2016"},
  {"n": "2015", "v": "2015"}
]

            },
            
            
            {
                "key": "lang",
                "name": "语言",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "国语", "v": "国语"},
  {"n": "英语", "v": "英语"},
  {"n": "粤语", "v": "粤语"},
  {"n": "闽南语", "v": "闽南语"},
  {"n": "韩语", "v": "韩语"},
  {"n": "日语", "v": "日语"},
  {"n": "法语", "v": "法语"},
  {"n": "德语", "v": "德语"},
  {"n": "其它", "v": "其它"}
]

            },
            
            
            {
                "key": "letter",
                "name": "字母",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "A", "v": "A"},
  {"n": "B", "v": "B"},
  {"n": "C", "v": "C"},
  {"n": "D", "v": "D"},
  {"n": "E", "v": "E"},
  {"n": "F", "v": "F"},
  {"n": "G", "v": "G"},
  {"n": "H", "v": "H"},
  {"n": "I", "v": "I"},
  {"n": "J", "v": "J"},
  {"n": "K", "v": "K"},
  {"n": "L", "v": "L"},
  {"n": "M", "v": "M"},
  {"n": "N", "v": "N"},
  {"n": "O", "v": "O"},
  {"n": "P", "v": "P"},
  {"n": "Q", "v": "Q"},
  {"n": "R", "v": "R"},
  {"n": "S", "v": "S"},
  {"n": "T", "v": "T"},
  {"n": "U", "v": "U"},
  {"n": "V", "v": "V"},
  {"n": "W", "v": "W"},
  {"n": "X", "v": "X"},
  {"n": "Y", "v": "Y"},
  {"n": "Z", "v": "Z"},
  {"n": "0-9", "v": "0-9"}
]


            },
{
  "key": "by",
  "name": "排序",
  "value": [
    {"n": "按最新", "v": "time"},
    {"n": "按最热", "v": "hits"},
    {"n": "按评分", "v": "score"}
  ]
}
        ],

        "dongman": [



            {
                "key": "cateId",
                "name": "类型",
                "value":

[
{"n": "最新国产动漫", "v": "guochan"},
{"n": "最新日韩动漫", "v": "rhdm"},
{"n": "最新港台动漫", "v": "gtdm"},
{"n": "最新欧美动漫", "v": "omdm"},
{"n": "最新动漫电影", "v": "dongmandianying"},{"n": "最新其他动漫", "v": "qtdm"}
]

            },
{
  "key": "class",
  "name": "剧情",
  "value": [
    {"n": "全部", "v": ""},
    {"n": "国产动漫", "v": "国产动漫"},
    {"n": "日韩动漫", "v": "日韩动漫"},
    {"n": "日本动漫", "v": "日本动漫"},
    {"n": "欧美动漫", "v": "欧美动漫"},
    {"n": "港台动漫", "v": "港台动漫"},
    {"n": "动漫电影", "v": "动漫电影"},
    {"n": "动画片", "v": "动画片"},
    {"n": "动画电影", "v": "动画电影"},
    {"n": "儿童", "v": "儿童"},
    {"n": "动作", "v": "动作"},
    {"n": "科幻", "v": "科幻"},
    {"n": "武侠", "v": "武侠"},
    {"n": "爱情", "v": "爱情"},
    {"n": "冒险", "v": "冒险"},
    {"n": "奇幻", "v": "奇幻"},
    {"n": "校园", "v": "校园"},
    {"n": "搞笑", "v": "搞笑"},
    {"n": "悬疑", "v": "悬疑"},
    {"n": "恐怖", "v": "恐怖"},
    {"n": "战斗", "v": "战斗"},
    {"n": "运动", "v": "运动"},
    {"n": "犯罪", "v": "犯罪"},
    {"n": "家庭", "v": "家庭"},
    {"n": "古装", "v": "古装"},
    {"n": "惊悚", "v": "惊悚"},
    {"n": "同性", "v": "同性"},
    {"n": "后宫", "v": "后宫"},
    {"n": "其他动漫", "v": "其他动漫"}
  ]
},
            {
                "key": "area",
                "name": "地区",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "国产", "v": "国产"},
  {"n": "日本", "v": "日本"},
  {"n": "欧美", "v": "欧美"},
  {"n": "其他", "v": "其他"}
]
            },
            
            {
                "key": "year",
                "name": "年份",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "2025", "v": "2025"},
  {"n": "2024", "v": "2024"},
  {"n": "2023", "v": "2023"},
  {"n": "2022", "v": "2022"},
  {"n": "2021", "v": "2021"},
  {"n": "2020", "v": "2020"},
  {"n": "2019", "v": "2019"},
  {"n": "2018", "v": "2018"},
  {"n": "2017", "v": "2017"},
  {"n": "2016", "v": "2016"},
  {"n": "2015", "v": "2015"}
]

            },
            
            
            {
                "key": "lang",
                "name": "语言",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "国语", "v": "国语"},
  {"n": "英语", "v": "英语"},
  {"n": "粤语", "v": "粤语"},
  {"n": "闽南语", "v": "闽南语"},
  {"n": "韩语", "v": "韩语"},
  {"n": "日语", "v": "日语"},
  {"n": "法语", "v": "法语"},
  {"n": "德语", "v": "德语"},
  {"n": "其它", "v": "其它"}
]

            },
            
            
            {
                "key": "letter",
                "name": "字母",
                "value":[
  {"n": "全部", "v": ""},
  {"n": "A", "v": "A"},
  {"n": "B", "v": "B"},
  {"n": "C", "v": "C"},
  {"n": "D", "v": "D"},
  {"n": "E", "v": "E"},
  {"n": "F", "v": "F"},
  {"n": "G", "v": "G"},
  {"n": "H", "v": "H"},
  {"n": "I", "v": "I"},
  {"n": "J", "v": "J"},
  {"n": "K", "v": "K"},
  {"n": "L", "v": "L"},
  {"n": "M", "v": "M"},
  {"n": "N", "v": "N"},
  {"n": "O", "v": "O"},
  {"n": "P", "v": "P"},
  {"n": "Q", "v": "Q"},
  {"n": "R", "v": "R"},
  {"n": "S", "v": "S"},
  {"n": "T", "v": "T"},
  {"n": "U", "v": "U"},
  {"n": "V", "v": "V"},
  {"n": "W", "v": "W"},
  {"n": "X", "v": "X"},
  {"n": "Y", "v": "Y"},
  {"n": "Z", "v": "Z"},
  {"n": "0-9", "v": "0-9"}
]


            },

{
  "key": "by",
  "name": "排序",
  "value": [
    {"n": "按最新", "v": "time"},
    {"n": "按最热", "v": "hits"},
    {"n": "按评分", "v": "score"}
  ]
}
        ],
        "duanju": [


{
  "key": "by",
  "name": "排序",
  "value": [
    {"n": "按最新", "v": "time"},
    {"n": "按最热", "v": "hits"},
    {"n": "按评分", "v": "score"}
  ]
}
],
        
                "donghuapian": [

            {
                "key": "area",
                "name": "地区",
                "value": [
  {"n": "全部", "v": ""},
  {"n": "大陆", "v": "大陆"},
  {"n": "香港", "v": "香港"},
  {"n": "台湾", "v": "台湾"},
  {"n": "美国", "v": "美国"},
  {"n": "法国", "v": "法国"},
  {"n": "英国", "v": "英国"},
  {"n": "日本", "v": "日本"},
  {"n": "韩国", "v": "韩国"},
  {"n": "德国", "v": "德国"},
  {"n": "泰国", "v": "泰国"},
  {"n": "印度", "v": "印度"},
  {"n": "意大利", "v": "意大利"},
  {"n": "西班牙", "v": "西班牙"},
  {"n": "加拿大", "v": "加拿大"},
  {"n": "其他", "v": "其他"}
  ]
            }

]
    }

    
}